insert into china.user
    (id, name, phone_number, city)
    values
    (1, 'Барри', '+79295999209', 'Москва'),
    (2, 'Оливер', '+79388145484', 'Санкт-Петербург'),
    (3, 'Роберт', '+79797999709', 'Москва'),
    (4, 'Джонни', '+79191997667', 'Казань'),
    (5, 'Микаса', '+79897775544', 'Якутск'),
    (6, 'Зейн', '+79777777777', 'Москва'),
    (7, 'Холси', '+79195873446', 'Санкт-Петербург'),
    (8, 'Питер', '+79875560112', 'Казань'),
    (9, 'Гена', '+79296213578', 'Екатеренбург'),
    (10, 'Киану', '+79775663438', 'Якутск');


insert into china.logist
    (id, name, phone_number, city)
    values
    (1, 'Сидзи', '+8615026861779', 'Гуандун'),
    (2, 'Нами', '+8657634290897', 'Фуцзянь'),
    (3, 'Леви', '+8677770990889', 'Цзянсу'),
    (4, 'Санджи', '+8657755432413', 'Гуандун'),
    (5, 'Мейли', '+8622155786756', 'Цзянсу'),
    (6, 'Чан', '+8697811376586', 'Фуцзянь'),
    (7, 'Ли', '+8666843911390', 'Гуандун'),
    (8, 'Рёта', '+8699000110001', 'Цзянсу'),
    (9, 'Есю', '+8690000875000', 'Пекин'),
    (10, 'Лялю', '+8677777009900', 'Пекин');

insert into china.factory
    (id, city, phone_number, product)
    values
    (1, 'Гуандун', '+8675645687564', 'Брюки'),
    (2, 'Фуцзянь', '+8660185182644' ,'Футболки'),
    (3, 'Пекин', '+8677712193866', 'Футболки'),
    (4, 'Чунцина', '+8699019555640', 'Куртки'),
    (5, 'Цзянсу', '+8675798165667', 'Шорты'),
    (6, 'Фуцзянь', '+8677750911343', 'Носки'),
    (7, 'Гуандун', '+8676645401923', 'Худи'),
    (8, 'Пекин', '+8699912165011', 'Джогеры'),
    (9, 'Цзянсу', '+8688832685672', 'Кеды'),
    (10, 'Пекин', '+8642377498165', 'Кроссовки');

insert into china.order
    (id, type, amount, price_all, weight_all)
    values
    (1, 'Брюки', 20, 13000, 11.2),
    (2, 'Футболки', 45, 13050, 8.1),
    (3, 'Футболки 2', 30, 11100, 7.2),
    (4, 'Куртки', 20, 70000, 24),
    (5, 'Шорты', 30, 23100, 6.3),
    (6, 'Носки', 100, 12000, 7),
    (7, 'Худи', 55, 63250, 47.85),
    (8, 'Кеды', 25, 42500, 27.5),
    (9, 'Джогеры', 20, 18000, 12),
    (10, 'Кроссовки', 20, 42000, 14);

insert into china.transport_company
    (id, price_for_kg, city_export, city_entry, delivery_time)
    values
    (1, 280, 'Гуандун', 'Санкт-Петербург', 35),
    (2, 300, 'Фуцзянь', 'Уфа', 40),
    (3, 165, 'Чунцина', 'Краснодар', 50),
    (4, 251, 'Цзянсу', 'Москва', 33),
    (5, 415, 'Пекин', 'Москва', 30),
    (6, 200, 'Шишаоу', 'Москва', 29),
    (7, 370, 'Гуандун', 'Казань', 34),
    (8, 395, 'Пекин', 'Санкт-Петербург', 45),
    (9, 390, 'Цзянсу', 'Москва', 36),
    (10, 245, 'Чунцина', 'Новосибирск', 60);

insert into china.storage
    (id, location, rent)
    values
    (1, 'Пекин', 90),
    (2, 'Чунцина', 121),
    (3, 'Чунцина', 98),
    (4, 'Пекин', 101),
    (5, 'Чунцина', 126),
    (6, 'Пекин', 125),
    (7, 'Гуандун', 98),
    (8, 'Нуандж', 70),
    (9, 'Фуцзянь', 69),
    (10, 'Цзянсу', 50);
